app/views/shops/_edit_form.html.erb

	<h2>
	<%= t('errors.template.header', :count=>@shop.errors.size, :model=>t('activerecord.models.shop'))%>
---
SELECT "shops".* FROM "shops" WHERE "shops"."id" = 980190962 LIMIT 1