app/views/admin/index.html.erb

<br />
<%= t('.wehave') %> <%=@total_orders%> <%=t('.order')%>
---
SELECT COUNT(*) FROM "orders"