app/views/users/_form.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
<h2>
	<%= t('errors.template.header', :count=>@user.errors.size, :model=>t('activerecord.models.user'))%>