app/views/orders/_form_edit.html.erb

SELECT "orders".* FROM "orders" WHERE "orders"."id" = 247390115 LIMIT 1
---
	<h2>
	<%= t('errors.template.header', :count=>@order.errors.size, :model=>t('activerecord.models.order'))%>