app/views/carts/_cart.html.erb

</div>
<%unless cart.line_items.empty?%>
---
SELECT "line_items".* FROM "line_items" WHERE ("line_items".cart_id = 18)
SELECT COUNT(*) FROM "line_items" WHERE ("line_items".cart_id = 36)