app/controllers/carts_controller.rb

  def index
    @carts = Cart.all.paginate :page => params[:page], :order=>'created_at desc',
    :per_page => @@per_page_item
---
SELECT "carts".* FROM "carts"

  def create
    @cart = Cart.new(params[:cart])

    respond_to do |format|
      if @cart.save
---
INSERT INTO "carts" ("updated_at", "created_at") VALUES ('2011-07-25 06:31:17.979639', '2011-07-25 06:31:17.979639')