app/controllers/line_items_controller.rb

SELECT "line_items".* FROM "line_items"
---
  def index
    @line_items = LineItem.all.paginate :page => params[:page], :order=>'created_at desc',
    :per_page => @@per_page_item

SELECT "products".* FROM "products" WHERE "products"."id" = 7 ORDER BY title LIMIT 1
INSERT INTO "carts" ("updated_at", "created_at") VALUES ('2011-07-19 08:48:54.859375', '2011-07-19 08:48:54.859375')
INSERT INTO "line_items" ("updated_at", "quantity", "product_id", "created_at", "order_id", "cart_id") VALUES ('2011-07-26 09:25:19.593750', 1, 19, '2011-07-26 09:25:19.593750', NULL, 55)
UPDATE "line_items" SET "updated_at" = '2011-07-25 03:20:57.682764', "quantity" = 2 WHERE "line_items"."id" = 22
---
  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    #@line_item = LineItem.new(params[:line_item])

    respond_to do |format|
      if @line_item.save