app/controllers/line_items_controller.rb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = 980190962 LIMIT 1
---
  def edit
    @line_item = LineItem.find(params[:id])

INSERT INTO "line_items" ("updated_at", "quantity", "order_id", "created_at", "cart_id", "product_id") VALUES ('2011-07-27 09:11:18.754050', 1, NULL, '2011-07-27 09:11:18.754050', 980190963, 207281424)
---
  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    #@line_item = LineItem.new(params[:line_item])

    respond_to do |format|
      if @line_item.save

SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = 980190962 LIMIT 1
---
  def update
    @line_item = LineItem.find(params[:id])

SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = 980190962 LIMIT 1
DELETE FROM "line_items" WHERE "line_items"."id" = 980190962
---
  def destroy
    @line_item = LineItem.find(params[:id])
    @line_item.destroy