app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" ORDER BY created_at desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "orders"
---
  def index

    @orders = current_user.shop.orders.paginate :page => params[:page], :order=>'created_at desc',
    :per_page => @@per_page_item

SELECT COUNT(*) FROM "line_items" WHERE ("line_items".cart_id = 50)
---
  def new
    if current_cart.line_items.empty?

SELECT "line_items".* FROM "line_items" WHERE ("line_items".order_id = 106)
UPDATE "line_items" SET "order_id" = 117, "updated_at" = '2011-07-27 03:25:50.500000', "cart_id" = NULL WHERE "line_items"."id" = 135
SELECT "products".* FROM "products" WHERE "products"."id" = 19 ORDER BY title LIMIT 1
INSERT INTO "carts" ("created_at", "updated_at") VALUES ('2011-07-27 02:20:34.218750', '2011-07-27 02:20:34.218750')
INSERT INTO "orders" ("email", "created_at", "name", "pay_type", "address", "updated_at") VALUES ('sklghakl@qq.com', '2011-07-26 09:12:28.140625', 'haoming', 'Purchase order', 'sysu-z2-402', '2011-07-26 09:12:28.140625')
---
  def create
    shop_order_hash = {}


    #orders
    current_cart.line_items.each do
    |item|


      item.product.sales += item.quantity
      item.product.save

      unless shop_order_hash.keys.include? item.product.shop
        order = Order.new(params[:order])
      order.shop = item.product.shop
      shop_order_hash[item.product.shop] = order

      end

      item.cart = nil;
      shop_order_hash[item.product.shop].line_items << item

DELETE FROM "carts" WHERE "carts"."id" = 50
---
    respond_to do |format|
      if success

        Cart.destroy(session[:cart_id])