app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE ("orders".shop_id = 980190962) ORDER BY created_at desc LIMIT 10 OFFSET 0
SELECT "shops".* FROM "shops" WHERE "shops"."id" = 0 LIMIT 1
---
  def index

    @orders = current_user.shop.orders.paginate :page => params[:page], :order=>'created_at desc',
    :per_page => @@per_page_item

SELECT "orders".* FROM "orders" WHERE "orders"."id" = 980190962 LIMIT 1
---
  def edit
    @order = Order.find(params[:id])

UPDATE "products" SET "updated_at" = '2011-07-29 11:44:48.141601', "sales" = 1 WHERE "products"."id" = 207281424
SELECT "shops".* FROM "shops" WHERE "shops"."id" = 0 LIMIT 1
INSERT INTO "carts" ("updated_at", "created_at") VALUES ('2011-07-21 16:38:18.119140', '2011-07-21 16:38:18.119140')
INSERT INTO "orders" ("updated_at", "email", "shop_id", "pay_type", "name", "created_at", "address", "state") VALUES ('2011-07-29 01:42:59.000000', 'jane@gmail.com', 980190962, 'Check', 'Jane', '2011-07-29 01:42:59.000000', 'SYSU', 'pending')
---
  def create
    shop_order_hash = {}


    #orders
    current_cart.line_items.each do
    |item|


      item.product.sales += item.quantity
      item.product.save

      unless shop_order_hash.keys.include? item.product.shop
        order = Order.new(params[:order])
      order.shop = item.product.shop
      shop_order_hash[item.product.shop] = order

      end

      item.cart = nil;
      shop_order_hash[item.product.shop].line_items << item

SELECT "orders".* FROM "orders" WHERE "orders"."id" = 980190962 LIMIT 1
---
  def update
    @order = Order.find(params[:id])