app/controllers/products_controller.rb

  def index

    @products = current_user.shop.products.paginate :page => params[:page], :order=>'created_at desc',
    :per_page => @@per_page_item
---
SELECT "products".* FROM "products" WHERE ("products".shop_id = 980190962) ORDER BY title, created_at desc LIMIT 2 OFFSET 0
SELECT "shops".* FROM "shops" WHERE "shops"."id" = 0 LIMIT 1
SELECT COUNT(*) FROM "products" WHERE ("products".shop_id = 980190962)

  def create
    @product = Product.new(params[:product])
    @product_types= BookType.all
    types = params[:type_name];
      types.each do |type|
        type = BookType.find_by_name(type)
        if type
        @product.book_types << type
---
INSERT INTO "products" ("updated_at", "rating_times", "title", "description", "price", "shop_id", "sales", "image_url", "created_at", "rating_sum") VALUES ('2011-07-29 12:03:41.722656', 0, 'Lorem Ipsum', 'Wibbles are fun!', 19.95, 980190962, 0, 'lorem.jpg', '2011-07-29 12:03:41.722656', 0)

  def update
    @product = Product.find(params[:id])
    @product.book_types = []
    types = params[:type_name];

    types.each do |type|
        type = BookType.find_by_name(type)
        if type
        @product.book_types << type
        end
    end

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
UPDATE "products" SET "updated_at" = '2011-07-29 12:03:41.987304', "title" = 'Lorem Ipsum', "description" = 'Wibbles are fun!', "price" = 19.95, "image_url" = 'lorem.jpg' WHERE "products"."id" = 207281424