app/controllers/products_controller.rb

  def index

    @products = current_user.shop.products.paginate :page => params[:page], :order=>'created_at desc',
    :per_page => @@per_page_item
---
SELECT "products".* FROM "products" ORDER BY title

  def create
    @product = Product.new(params[:product])
    @product_types= BookType.all
    types = params[:type_name];
      types.each do |type|
        type = BookType.find_by_name(type)
        if type
        @product.book_types << type
---
INSERT INTO "products" ("updated_at", "title", "price", "description", "image_url", "created_at") VALUES ('2011-07-20 03:29:33.937500', 'fsd', 23.0, 'dsfdsfdsf', '/images/rtp.jpg', '2011-07-20 03:29:33.937500')

  def update
    @product = Product.find(params[:id])
    @product.book_types = []
    types = params[:type_name];

    types.each do |type|
        type = BookType.find_by_name(type)
        if type
        @product.book_types << type
        end
    end

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT "products".* FROM "products" WHERE "products"."id" = 6 ORDER BY title LIMIT 1
UPDATE "products" SET "updated_at" = '2011-07-19 08:17:38.593750', "title" = 'Abc study', "price" = 50.0, "description" = 'ABCDEFG let''s go！' WHERE "products"."id" = 8

  def who_bought
    @product = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = 3 ORDER BY title LIMIT 1