app/controllers/shops_controller.rb

  def index
    @shops = Shop.all.paginate :page => params[:page], :order=>'created_at desc',
    :per_page => @@per_page_item
---
SELECT "shops".* FROM "shops"

  def show
    @shop = Shop.find(params[:id])
---
SELECT "shops".* FROM "shops" WHERE "shops"."id" = 980190962 LIMIT 1

  def edit
    @shop = Shop.find(params[:id])
---
SELECT "shops".* FROM "shops" WHERE "shops"."id" = 980190962 LIMIT 1

  def create

    file = File.new("b.txt", "w")

    @shop = Shop.new(params[:shop])

    file.puts params[:shop]

    file.puts @shop.attributes

    username = params[:name]
    password = params[:password]
    confirm = params[:confirmation]

    respond_to do |format|
      if  password != confirm

        flash[:notice] = "confirmation failure"
        format.html { redirect_to(:action => "new") }
      else

        @user = User.new
        @user.name = username
        @user.password = password
        @user.role = 'host'

        @shop.users << @user
---
INSERT INTO "shops" ("updated_at", "email", "telephone", "image_url", "name", "description", "created_at") VALUES ('2011-07-29 11:53:58.000000', 'a@a.com', '12345678', 'a.jpg', 'MyString', 'nothing', '2011-07-29 11:53:58.000000')
INSERT INTO "users" ("hashed_password", "role", "shop_id", "updated_at", "name", "created_at", "salt") VALUES ('e9a31685842d75bfc461ff7257f2e4197e8e38c0e5746a68f433265117e4914c', 'host', 980190963, '2011-07-27 14:02:06.985917', 'hostname', '2011-07-27 14:02:06.985917', '510684840.00760091612255542')

  def update
    @shop = Shop.find(params[:id])
---
SELECT "shops".* FROM "shops" WHERE "shops"."id" = 980190962 LIMIT 1

  def destroy
    @shop = Shop.find(params[:id])
---
SELECT "shops".* FROM "shops" WHERE "shops"."id" = 980190962 LIMIT 1