app/controllers/store_controller.rb

  def index
    #@products = Product.all.paginate :page => params[:page], :order=>'created_at desc',
    #                        :per_page => @@per_page_item
    #@cart = current_cart

    @hot_products = Product.all.sort{|p1, p2| p2.sales <=> p1.sales }[0,4]
---
SELECT "products".* FROM "products" ORDER BY title