app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE ("users".shop_id = 980190962) ORDER BY created_at desc LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "users" WHERE ("users".shop_id = 980190962)
---
  def index
    if current_user.role == "administrator"
      @users = User.where(:role => "administrator")
    else
      @users = current_user.shop.users
    end

    @users = @users.paginate :page => params[:page], :order=>'created_at desc',
    :per_page => @@per_page_item

SELECT "users".* FROM "users" WHERE "users"."id" = 980190962 LIMIT 1
---
  def show
    @user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
---
  def edit
    @user = User.find(params[:id])

INSERT INTO "users" ("updated_at", "name", "hashed_password", "salt", "created_at", "shop_id", "role") VALUES ('2011-07-29 12:03:42.870117', 'sam', 'b658cc021b2c88fe1f99616c80d20be2ce3c1e8c95a9c779a51c5f739de043e6', '398251320.0186350441773049', '2011-07-29 12:03:42.870117', 980190962, 'clerk')
---
  def create
    @user = User.new(params[:user])

    if(current_user.role == 'host')
      @user.role = 'clerk'
      @user.shop = current_user.shop
    end

    if(current_user.role == 'administrator')
      @user.role = 'administrator'
    end

    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
UPDATE "users" SET "updated_at" = '2011-07-27 05:56:58.314111', "hashed_password" = '60c71c812ebccae1433d8158a765014ca29734cb13e8ae2c3c1081c3f5ac5928', "salt" = '509340000.00881871280823443', "name" = 'sam' WHERE "users"."id" = 980190962
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
---
  def destroy
    @user = User.find(params[:id])