app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY name
---
  def index
    if current_user.role == "administrator"
      @users = User.where(:role => "administrator")
    else
      @users = current_user.shop.users
    end

    @users = @users.paginate :page => params[:page], :order=>'created_at desc',
    :per_page => @@per_page_item

INSERT INTO "users" ("created_at", "updated_at", "name", "hashed_password", "salt") VALUES ('2011-07-27 09:26:37.765625', '2011-07-27 09:26:37.765625', 'dave', '4ed3c34361b7a09892870d01779f6fd89fcb950756be3874eb483b8e3bfcb7ab', '371047320.0182165412908309')
---
  def create
    @user = User.new(params[:user])

    if(current_user.role == 'host')
      @user.role = 'clerk'
      @user.shop = current_user.shop
    end

    if(current_user.role == 'administrator')
      @user.role = 'administrator'
    end

    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
UPDATE "users" SET "hashed_password" = '92df25efee288c06930d3e6c45a1507d68069577b161261a79f62faa655feef1', "salt" = '366493800.0593406235388754', "updated_at" = '2011-07-27 09:29:12.796875' WHERE "users"."id" = 2
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
DELETE FROM "users" WHERE "users"."id" = 1
---
  def destroy
    @user = User.find(params[:id])
    unless @user.id.eql? current_user.id
    @user.destroy