app/views/products/_form.html.erb

	<h2>
	<%= t('errors.template.header', :count=>@product.errors.size, :model=>t('activerecord.models.product'))%>
---
SELECT "products".* FROM "products" WHERE "products"."id" = 6 ORDER BY title LIMIT 1