app/views/products/index.html.erb

SELECT "products".* FROM "products" ORDER BY title
---
			<td class="product_title">
					<%= link_to product.title.length>30?product.title[0,30]+"...": product.title,
					:controller=>"products",
					:action =>"show_to_buyers",
					:id=>product	 %>