app/views/store/index.html.erb

SELECT "products".* FROM "products" ORDER BY title
---
					</div>
						<%= link_to product.title.length>10?product.title[0,10]+"...":product.title, :controller=>"products", :action =>"show_to_buyers", :id=>product	 %>